//Problem 03 : Virus in my Array
//⚠️ Function Name Must be deleteInvalids()

//ত োমাকে deleteInvalids() নামে এমন একটা ফাংশন ক্রি য়ে ট করতে হবে যা ইনপুট হি সে বে //একটি Array
//নে বে । ফাংশন টি আরে কটি Array রি টার্ন করবে যে খানে ভ্যালুগুল ো হবে শুধুনাম্বার । অর্থাৎ //Array এর যে সকল
//elements নাম্বার না , তাদে র ডি লি ট করে শুধুমাত্র নাম্বার গুল ো কে Array আকারে রি টার্ন //করতে হবে ।
//তুমি যদি এই ফাংশনে এই [ NaN, 1,12,0 ,-1 , undefined ] Array টি পাস কর ো কর ো //তাহলে সে ত োমাকে
//রি টার্ন করবে [ 1 , 12 , 0 , -1 ]

//Input :
//ফাংশন টি ইনপুট নে বে একটি Array । Array এর উপাদান গুল োর Datatype যে ক োন ধরনে র হতে পারে ।
/*function signature/sample */
//function checkName(name) {

//write your code here
//}

//Output :
//ফাংশন টি আউটপুট দে বে আরে কটি Array । Array এর উপাদান গুল ো হবে শুধুমাত্র নাম্বার ।

//Challenge 📢 : ফাংশন টি তে Array ছাড়া অন্য ক োন ভ্যালুপাস করলে সে টা একটা error //message
//রি টার্ন করবে ।

/**
 *   // First check the argument type using Array.isArray method, which return true or false. if given argument type is !== array then return 'invalid'
 */

function deleteInvalids(array) {
  if (!Array.isArray(array)) {
    return "invalid array. input should be a valid Array.";
  }

  let numbersArr = [];
  for (const element of array) {
    if (!isNaN(element) && typeof element === "number") {
      numbersArr.push(element);
    }
  }
  return numbersArr;
}

// console.log(deleteInvalids());
